# Add/Remove Rows and Columns from the DaraFrames

In [1]:
import pandas as pd

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
df= pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
# For adding the columns -- adding the first and last name column
df['first'] + ' ' + df['last'] # it showd the added column name with first and last with a space

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [6]:
#create a new column and add these values
df['full_name'] = df['first'] + ' ' + df['last']

In [7]:
df #we can see that the DF has the new column which has full_name with the combined column of first and last

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [8]:
# Removing columns of first and last name columns
df.drop(columns=['first','last'])

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [9]:
df.drop(columns=['first','last'], inplace=True)

In [10]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [11]:
#splitting the full_name column
df['full_name'].str.split(' ')# here we get the fist and last name in a list

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [12]:
#for assigning the values to two different columns
df['full_name'].str.split(' ', expand=True) # we got the splited column not the list

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [13]:
# for accessing multiple columns we have to use [[]]
df[['first','last']] = df['full_name'].str.split(' ',expand = True)#it added the new column with the first and last values

In [14]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [15]:
# Adding/removing rows to DF
# Adding single row of data
df.append({'first':'Tony'}, ignore_index=True) #ignore_index has to be true, if not given will result it error

#Since we added only one column the remaining were shown as NaN

C:\Users\Ajith\AppData\Local\Temp\ipykernel_5208\1202976612.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'Tony'}, ignore_index=True) #ignore_index has to be true, if not given will result it error

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [16]:
# creating a new Df for adding it to the old df
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [17]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [18]:
df.append(df2, ignore_index=True, sort=False) #it added the 2 new rows, here we have to add sort=False

C:\Users\Ajith\AppData\Local\Temp\ipykernel_5208\3971865087.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False) #it added the 2 new rows, here we have to add sort=False

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [19]:
df = df.append(df2, ignore_index=True, sort=False)

C:\Users\Ajith\AppData\Local\Temp\ipykernel_5208\3370980109.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

In [20]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [21]:
#removing rows
df.drop(index=4)#set inplace = True for to make changes in the dataframe

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [22]:
# for removing the last name with Doe
df.drop(index=df[df['last']=='Doe'].index) #since it make the code difficult to read we will simplify this

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [23]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index) #this code is more easier to read than above

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers